app/Controllers/Auth.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@baixadasolidaria.com'
 LIMIT 1
---
    public function autenticar()
    {
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        $model = new AdminModel();
        $admin = $model->where('email', $email)->first();